x = 38
print("дратути!")
if x < 0:
  print("Меньше нуля")
print("дотвидания!")
#
a, b = 44.6, 23
if a > b:
  print("a > b")
if a > 0 and a > b:
  print('успех')
if (a > b) and (a > 0 or b < 1000):
  print('успех')
if 5 < b and b < 23.1:
  print ('успех')
#
if '34' > '123':
  print('успех')
if '123' > '12':
  print('успех')
if [1, 2] > [1, 1]:
  print('успех')
#
#if '6' > 5:
  print('разные типы')
#if [5, 6] > 5:
  print('нельзя сравнивать')
if '6' != 5:
  print('только проверять их неравенство')